scripts_autonuma/results/ycsb_c/1-8/output.log
<_io.BytesIO object at 0x7fe2d9cc3560> /home/ssd/yi/workloads/ycsb-0.15.0/bin/ycsb command database [options]
<_io.BytesIO object at 0x7fe2d9cc3560> 
Commands:
<_io.BytesIO object at 0x7fe2d9cc3560>     load           Execute the load phase
<_io.BytesIO object at 0x7fe2d9cc3560>     run            Execute the transaction phase
<_io.BytesIO object at 0x7fe2d9cc3560>     shell          Interactive mode
<_io.BytesIO object at 0x7fe2d9cc3560> 
Databases:
<_io.BytesIO object at 0x7fe2d9cc3560>     accumulo       https://github.com/brianfrankcooper/YCSB/tree/master/accumulo
<_io.BytesIO object at 0x7fe2d9cc3560>     accumulo1.6    https://github.com/brianfrankcooper/YCSB/tree/master/accumulo1.6
<_io.BytesIO object at 0x7fe2d9cc3560>     accumulo1.7    https://github.com/brianfrankcooper/YCSB/tree/master/accumulo1.7
<_io.BytesIO object at 0x7fe2d9cc3560>     accumulo1.8    https://github.com/brianfrankcooper/YCSB/tree/master/accumulo1.8
<_io.BytesIO object at 0x7fe2d9cc3560>     aerospike      https://github.com/brianfrankcooper/YCSB/tree/master/aerospike
<_io.BytesIO object at 0x7fe2d9cc3560>     arangodb       https://github.com/brianfrankcooper/YCSB/tree/master/arangodb
<_io.BytesIO object at 0x7fe2d9cc3560>     arangodb3      https://github.com/brianfrankcooper/YCSB/tree/master/arangodb3
<_io.BytesIO object at 0x7fe2d9cc3560>     asynchbase     https://github.com/brianfrankcooper/YCSB/tree/master/asynchbase
<_io.BytesIO object at 0x7fe2d9cc3560>     azuredocumentdb https://github.com/brianfrankcooper/YCSB/tree/master/azuredocumentdb
<_io.BytesIO object at 0x7fe2d9cc3560>     azuretablestorage https://github.com/brianfrankcooper/YCSB/tree/master/azuretablestorage
<_io.BytesIO object at 0x7fe2d9cc3560>     basic          https://github.com/brianfrankcooper/YCSB/tree/master/basic
<_io.BytesIO object at 0x7fe2d9cc3560>     basicts        https://github.com/brianfrankcooper/YCSB/tree/master/basicts
<_io.BytesIO object at 0x7fe2d9cc3560>     cassandra-cql  https://github.com/brianfrankcooper/YCSB/tree/master/cassandra
<_io.BytesIO object at 0x7fe2d9cc3560>     cassandra2-cql https://github.com/brianfrankcooper/YCSB/tree/master/cassandra2
<_io.BytesIO object at 0x7fe2d9cc3560>     cloudspanner   https://github.com/brianfrankcooper/YCSB/tree/master/cloudspanner
<_io.BytesIO object at 0x7fe2d9cc3560>     couchbase      https://github.com/brianfrankcooper/YCSB/tree/master/couchbase
<_io.BytesIO object at 0x7fe2d9cc3560>     couchbase2     https://github.com/brianfrankcooper/YCSB/tree/master/couchbase2
<_io.BytesIO object at 0x7fe2d9cc3560>     dynamodb       https://github.com/brianfrankcooper/YCSB/tree/master/dynamodb
<_io.BytesIO object at 0x7fe2d9cc3560>     elasticsearch  https://github.com/brianfrankcooper/YCSB/tree/master/elasticsearch
<_io.BytesIO object at 0x7fe2d9cc3560>     elasticsearch5 https://github.com/brianfrankcooper/YCSB/tree/master/elasticsearch5
<_io.BytesIO object at 0x7fe2d9cc3560>     foundationdb   https://github.com/brianfrankcooper/YCSB/tree/master/foundationdb
<_io.BytesIO object at 0x7fe2d9cc3560>     geode          https://github.com/brianfrankcooper/YCSB/tree/master/geode
<_io.BytesIO object at 0x7fe2d9cc3560>     googlebigtable https://github.com/brianfrankcooper/YCSB/tree/master/googlebigtable
<_io.BytesIO object at 0x7fe2d9cc3560>     googledatastore https://github.com/brianfrankcooper/YCSB/tree/master/googledatastore
<_io.BytesIO object at 0x7fe2d9cc3560>     hbase098       https://github.com/brianfrankcooper/YCSB/tree/master/hbase098
<_io.BytesIO object at 0x7fe2d9cc3560>     hbase10        https://github.com/brianfrankcooper/YCSB/tree/master/hbase10
<_io.BytesIO object at 0x7fe2d9cc3560>     hbase12        https://github.com/brianfrankcooper/YCSB/tree/master/hbase12
<_io.BytesIO object at 0x7fe2d9cc3560>     hbase14        https://github.com/brianfrankcooper/YCSB/tree/master/hbase14
<_io.BytesIO object at 0x7fe2d9cc3560>     hbase20        https://github.com/brianfrankcooper/YCSB/tree/master/hbase20
<_io.BytesIO object at 0x7fe2d9cc3560>     hypertable     https://github.com/brianfrankcooper/YCSB/tree/master/hypertable
<_io.BytesIO object at 0x7fe2d9cc3560>     ignite         https://github.com/brianfrankcooper/YCSB/tree/master/ignite
<_io.BytesIO object at 0x7fe2d9cc3560>     ignite-sql     https://github.com/brianfrankcooper/YCSB/tree/master/ignite
<_io.BytesIO object at 0x7fe2d9cc3560>     infinispan     https://github.com/brianfrankcooper/YCSB/tree/master/infinispan
<_io.BytesIO object at 0x7fe2d9cc3560>     infinispan-cs  https://github.com/brianfrankcooper/YCSB/tree/master/infinispan
<_io.BytesIO object at 0x7fe2d9cc3560>     jdbc           https://github.com/brianfrankcooper/YCSB/tree/master/jdbc
<_io.BytesIO object at 0x7fe2d9cc3560>     kudu           https://github.com/brianfrankcooper/YCSB/tree/master/kudu
<_io.BytesIO object at 0x7fe2d9cc3560>     maprdb         https://github.com/brianfrankcooper/YCSB/tree/master/maprdb
<_io.BytesIO object at 0x7fe2d9cc3560>     maprjsondb     https://github.com/brianfrankcooper/YCSB/tree/master/maprjsondb
<_io.BytesIO object at 0x7fe2d9cc3560>     memcached      https://github.com/brianfrankcooper/YCSB/tree/master/memcached
<_io.BytesIO object at 0x7fe2d9cc3560>     mongodb        https://github.com/brianfrankcooper/YCSB/tree/master/mongodb
<_io.BytesIO object at 0x7fe2d9cc3560>     mongodb-async  https://github.com/brianfrankcooper/YCSB/tree/master/mongodb
<_io.BytesIO object at 0x7fe2d9cc3560>     nosqldb        https://github.com/brianfrankcooper/YCSB/tree/master/nosqldb
<_io.BytesIO object at 0x7fe2d9cc3560>     orientdb       https://github.com/brianfrankcooper/YCSB/tree/master/orientdb
<_io.BytesIO object at 0x7fe2d9cc3560>     rados          https://github.com/brianfrankcooper/YCSB/tree/master/rados
<_io.BytesIO object at 0x7fe2d9cc3560>     redis          https://github.com/brianfrankcooper/YCSB/tree/master/redis
<_io.BytesIO object at 0x7fe2d9cc3560>     rest           https://github.com/brianfrankcooper/YCSB/tree/master/rest
<_io.BytesIO object at 0x7fe2d9cc3560>     riak           https://github.com/brianfrankcooper/YCSB/tree/master/riak
<_io.BytesIO object at 0x7fe2d9cc3560>     rocksdb        https://github.com/brianfrankcooper/YCSB/tree/master/rocksdb
<_io.BytesIO object at 0x7fe2d9cc3560>     s3             https://github.com/brianfrankcooper/YCSB/tree/master/s3
<_io.BytesIO object at 0x7fe2d9cc3560>     solr           https://github.com/brianfrankcooper/YCSB/tree/master/solr
<_io.BytesIO object at 0x7fe2d9cc3560>     solr6          https://github.com/brianfrankcooper/YCSB/tree/master/solr6
<_io.BytesIO object at 0x7fe2d9cc3560>     tarantool      https://github.com/brianfrankcooper/YCSB/tree/master/tarantool
<_io.BytesIO object at 0x7fe2d9cc3560> 
Options:
<_io.BytesIO object at 0x7fe2d9cc3560>     -P file        Specify workload file
<_io.BytesIO object at 0x7fe2d9cc3560>     -cp path       Additional Java classpath entries
<_io.BytesIO object at 0x7fe2d9cc3560>     -jvm-args args Additional arguments to the JVM
<_io.BytesIO object at 0x7fe2d9cc3560>     -p key=value   Override workload property
<_io.BytesIO object at 0x7fe2d9cc3560>     -s             Print status to stderr
<_io.BytesIO object at 0x7fe2d9cc3560>     -target n      Target ops/sec (default: unthrottled)
<_io.BytesIO object at 0x7fe2d9cc3560>     -threads n     Number of client threads (default: 1)
<_io.BytesIO object at 0x7fe2d9cc3560> 
Workload Files:
    There are various predefined workloads under workloads/ directory.
    See https://github.com/brianfrankcooper/YCSB/wiki/Core-Properties
    for the list of workload properties.
<_io.TextIOWrapper name='<stderr>' mode='w' encoding='utf-8'> [OVERALL], RunTime(ms), 779894
[OVERALL], Throughput(ops/sec), 160278.191651686
[TOTAL_GCS_PS_Scavenge], Count, 989
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 5630
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.7218929751991937
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 989
[TOTAL_GC_TIME], Time(ms), 5630
[TOTAL_GC_TIME_%], Time(%), 0.7218929751991937
[READ], Operations, 125000000
[READ], AverageLatency(us), 523.719176152
[READ], MinLatency(us), 22
[READ], MaxLatency(us), 46911
[READ], 95thPercentileLatency(us), 2133
[READ], 99thPercentileLatency(us), 3043
[READ], Return=OK, 125000000
[CLEANUP], Operations, 112
[CLEANUP], AverageLatency(us), 2756.285714285714
[CLEANUP], MinLatency(us), 148
[CLEANUP], MaxLatency(us), 14991
[CLEANUP], 95thPercentileLatency(us), 6279
[CLEANUP], 99thPercentileLatency(us), 7407
java -cp /home/ssd/yi/workloads/ycsb-0.15.0/memcached-binding/conf:/home/ssd/yi/workloads/ycsb-0.15.0/conf:/home/ssd/yi/workloads/ycsb-0.15.0/lib/jackson-mapper-asl-1.9.4.jar:/home/ssd/yi/workloads/ycsb-0.15.0/lib/core-0.15.0.jar:/home/ssd/yi/workloads/ycsb-0.15.0/lib/htrace-core4-4.1.0-incubating.jar:/home/ssd/yi/workloads/ycsb-0.15.0/lib/jackson-core-asl-1.9.4.jar:/home/ssd/yi/workloads/ycsb-0.15.0/lib/HdrHistogram-2.1.4.jar:/home/ssd/yi/workloads/ycsb-0.15.0/memcached-binding/lib/core-0.15.0.jar:/home/ssd/yi/workloads/ycsb-0.15.0/memcached-binding/lib/htrace-core4-4.1.0-incubating.jar:/home/ssd/yi/workloads/ycsb-0.15.0/memcached-binding/lib/log4j-1.2.17.jar:/home/ssd/yi/workloads/ycsb-0.15.0/memcached-binding/lib/spymemcached-2.11.4.jar:/home/ssd/yi/workloads/ycsb-0.15.0/memcached-binding/lib/memcached-binding-0.15.0.jar:/home/ssd/yi/workloads/ycsb-0.15.0/memcached-binding/lib/jackson-mapper-asl-1.9.13.jar:/home/ssd/yi/workloads/ycsb-0.15.0/memcached-binding/lib/jackson-core-asl-1.9.4.jar:/home/ssd/yi/workloads/ycsb-0.15.0/memcached-binding/lib/HdrHistogram-2.1.4.jar com.yahoo.ycsb.Client -db com.yahoo.ycsb.db.MemcachedClient -s -P /home/ssd/yi/workloads/ycsb-0.15.0/workloads/workloadc -p memcached.hosts=127.0.0.1 -p memcached.port=11211 -p recordcount=1000000000 -p operationcount=125000000 -threads 112 -t